darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
/*
 * BeehiveScale - Весы пчеловода (ESP8266)
 * Версия определена в Version.h (FW_VERSION).
 */

#include "Version.h"
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <HX711.h>
#include <EEPROM.h>
#if defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <ArduinoOTA.h>
#elif defined(ESP32)
#include <WiFi.h>
#include <ESPmDNS.h>
#include <ArduinoOTA.h>
#include <esp_task_wdt.h>
#endif

#include "Display.h"
#include "Scale.h"
#include "Button.h"
#include "Memory.h"
#include "RTC_Module.h"
#include "Temperature.h"
#include "Connectivity.h"
#include "SleepManager.h"
#include "WebServerModule.h"
#include "Battery.h"
#include "Logger.h"

// HX711 пины. По умолчанию D5/D6 (GPIO14/12) — стандарт ESP8266, как у Bee_Lite v1.1.
// Для отладочного отката к старой распиновке (D0/TX) — раскомментировать LEGACY_HX711_PINS.
// 2026-05-04: переход на D5/D6 для Фазы 2 (DEEP_SLEEP) — D0 нужен под перемычку D0→RST для wake-from-sleep.
// #define LEGACY_HX711_PINS  // OFF: HX711 на D5/D6, D0 свободен под wake-up

#ifdef LEGACY_HX711_PINS
  #define DT_PIN          16   // D0 — HX711 DOUT (старая распиновка, без pull-up)
  #define SCK_PIN          1   // TX — HX711 SCK (старая распиновка, заблокирует Serial debug)
#else
  #define DT_PIN          14   // D5 — HX711 DOUT (новая стандартная распиновка)
  #define SCK_PIN         12   // D6 — HX711 SCK
#endif
#define BUTTON_PIN       0   // D3 — boot-strap! Не держать при включении
#define MENU_BTN_PIN     2   // D4 — boot-strap! Не держать при включении
#define LCD_ADDR      0x27

#define WEIGHT_SAVE_MS    300000UL
#define WEIGHT_SAVE_THR     0.05f
#define TARE_COUNT             2   // 2 нажатия с подтверждением — защита от случайного тарирования
#define TARE_TIMEOUT_MS     3000UL  // Окно для второго нажатия после первого (3 сек)
#define MENU_SCREENS           8
#define STABLE_BUF_SIZE        6
#define STABLE_THR             0.02f
#define STABLE_SAVE_MIN_MS 600000UL  // 10 мин — минимальный интервал между EEPROM-записями при стабилизации
#define SPIKE_FILTER_KG      5.0f    // Отбросить показание если скачок > 5 кг
#define ZERO_DEADBAND_KG     0.05f   // Auto-zero: всё что |вес| < 50г → показываем 0
#define SCALE_READ_INTERVAL_MS 1500UL // Период чтения HX711 (баланс между откликом и нагрузкой)
#define WDT_TIMEOUT_SEC       30
#define AUTO_SLEEP_MS     180000UL  // 3 минуты бездействия → deep sleep

static inline void app_wdt_init() {
#if defined(ESP32)
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    esp_task_wdt_config_t wdt_cfg = {
      .timeout_ms = WDT_TIMEOUT_SEC * 1000,
      .idle_core_mask = 0,
      .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&wdt_cfg);
    esp_task_wdt_add(NULL);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
    esp_task_wdt_add(NULL);
  #endif
#elif defined(ESP8266)
  ESP.wdtFeed();
#endif
}

static inline void app_wdt_reset() {
#if defined(ESP32)
  esp_task_wdt_reset();
#elif defined(ESP8266)
  ESP.wdtFeed();
  yield();
#endif
}

LiquidCrystal_I2C lcd(LCD_ADDR, 16, 2);
HX711             scale;

// Serial доступен всю работу: HX711 теперь на D5/D6, UART TX (GPIO1) свободен.

struct SystemState {
  float calibrationFactor = 2280.0f;
  long  offset            = 0;
  float lastSavedWeight   = 0.0f;
  float smoothedWeight    = 0.0f;
  bool  sensorReady       = false;
  bool  emaInitialized    = false;
  TempData tempData;
  float    rtcTempC       = NAN;
  TimeStamp currentTime;
  int  menuScreen         = 0;
  int  lastMenuScreen     = -1;
  bool needsRedraw        = true;
  bool wifiOk             = false;
  float prevWeight        = 0.0f;
  long  prevOffset        = 0;
  bool  hasPrevOffset     = false;  // true после первого тарирования в сессии
  float batVoltage        = 0.0f;
  int   batPercent        = 0;
  String datetimeStr      = "--";
  bool  weightStable      = false;
};

SystemState    sys;
ButtonState    btnMain;
ButtonState    btnMenu;
SleepPersistData persist;
bool webServerStarted = false;
unsigned long lastActivityTime = 0;  // Таймер бездействия для auto-sleep
bool diagRunRequested = false;       // Флаг запуска диагностики
bool diagDone = false;               // Диагностика завершена (сводка на экране)

void handle_buttons();
void process_weight();
void process_temperature();
void update_interface();
void display_screen_weight();
void display_screen_temp();
void display_screen_diff();
void display_screen_status();
void display_screen_datetime();
void display_screen_battery();
void display_error();
void display_screen_calib_menu();
void display_screen_diag();
void perform_taring();
void undo_tare();
void perform_calibration();
void adjust_calibration();
void show_splash_screen();
void start_webserver();
void check_auto_sleep();

void setup() {
  Serial.begin(115200);
  Serial.println(F("\n[" FW_FULLNAME "] boot"));

#if defined(ESP8266)
  ESP.wdtDisable();  // Отключаем программный WDT на время setup (ESP8266 ~3сек по умолчанию)
#endif
  app_wdt_init();
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  pinMode(MENU_BTN_PIN, INPUT_PULLUP);
  button_attach_interrupt(BUTTON_PIN, btnMain);
  button_attach_interrupt(MENU_BTN_PIN, btnMenu);

#if defined(ESP8266)
  Wire.begin(4, 5);
  Wire.setClock(100000);             // 100 кГц — стабильнее для длинных проводов
  Wire.setClockStretchLimit(2500);   // DS3231 может тянуть до 2ms при конверсии температуры
#else
  Wire.begin();
#endif
#if defined(ESP32)
  if (!EEPROM.begin(EEPROM_SIZE)) {
    Serial.println(F("[EEPROM] Init FAILED!"));
  }
#elif defined(ESP8266)
  EEPROM.begin(EEPROM_SIZE);
#endif

  sleep_init();
  sleep_load_persistent(persist);
#ifdef SLEEP_MODE_CONTINUOUS
  persist.wakeupCount++;
  sleep_save_persistent(persist);
#endif

  lcd_init(lcd);

#ifdef LEGACY_HX711_PINS
  // Старая распиновка использует TX (GPIO1) как HX711 SCK.
  // Закрываем Serial чтобы не было UART-мусора на линии clock.
  Serial.flush();
  Serial.end();
#endif
  scale_init(scale, DT_PIN, SCK_PIN);
  sys.sensorReady = check_sensor(scale);

  bool rtcOk = rtc_init();

  if (!temp_init()) {
    Serial.println(F("[Temp] No sensor, readings disabled"));
  }

  load_calibration_data(sys.calibrationFactor, sys.offset, sys.lastSavedWeight);
  sys.prevOffset = load_prev_offset();
  web_settings_init();
  ext_settings_init();
  sched_settings_init();
  tg_report_settings_init();
  tg_settings_init();
  credentials_init();
  // prevWeight при загрузке из EEPROM addr 30 (эталон пользователя).
  // Fallback на lastSavedWeight если EEPROM addr 30 ещё не записан.
  sys.prevWeight = load_prev_weight(sys.lastSavedWeight);

