darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  if (sys.wifiOk && !webServerStarted) {
    start_webserver();
  }

  if (sys.wifiOk && webServerStarted) {
    webserver_handle();
    static unsigned long lastQueueProc = 0;
    if (now - lastQueueProc >= 60000UL) {
      queue_process();
      lastQueueProc = now;
    }
  }

  if (get_wifi_mode() == 1 && sys.wifiOk) {
    if (now - lastTsUpload >= TS_UPDATE_INTERVAL_MS) {
      float rtcT = rtc_temperature();
      if (!ts_send(sys.smoothedWeight, sys.tempData.temperature,
                   sys.tempData.humidity, rtcT)) {
        queue_add(sys.smoothedWeight, sys.tempData.temperature, 
                  sys.tempData.humidity, rtcT, sys.datetimeStr);
      }
      lastTsUpload = now;
    }

    uint32_t tgRptMs = get_tg_report_interval_min() * 60000UL;
#ifdef SLEEP_MODE_DEEP_SLEEP
    // В deep sleep millis() сбрасывается при каждом пробуждении —
    // отправляем TG на каждом пробуждении (расписание и есть интервал отчётов)
    bool doTgReport = (tgRptMs > 0);
#else
    bool doTgReport = (tgRptMs > 0 && now - lastTgReport >= tgRptMs);
#endif
    if (doTgReport) {
      TimeStamp ts = rtc_now();
      String dt = rtc_format_datetime(ts);
      tg_send_report(sys.smoothedWeight, sys.tempData.temperature,
                     sys.tempData.humidity, dt);
      lastTgReport = now;
    }
  }

  check_auto_sleep();

#ifdef SLEEP_MODE_DEEP_SLEEP
  {
    log_append(sys.datetimeStr, sys.smoothedWeight,
               sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
  }
  persist.lastWeight = sys.smoothedWeight;
  persist.lastTempC = sys.tempData.temperature;
  persist.wakeupCount++;
  sleep_save_persistent(persist);
#if defined(ESP32)
  esp_task_wdt_delete(NULL);
#endif
  uint32_t sleepDur = sys.currentTime.valid
    ? sched_next_sec(sys.currentTime.hour, sys.currentTime.minute)
    : get_sleep_sec();
  // Guard (пункт 8): sched_next_sec() может вернуть 0 в пограничном случае
  // ровно на минуте расписания — без этой защиты ESP проснётся мгновенно
  // и будет непрерывно войти-выйти из deep sleep, разряжая батарею.
  if (sleepDur < 30) sleepDur = get_sleep_sec();
  sleep_enter(sleepDur);
#endif
}

void handle_buttons() {
  static int pressCount = 0;
  static unsigned long lastPressTime = 0;

  // Boot grace period: первые 2 секунды после старта игнорируем кнопки.
  // GPIO0 (D3) и GPIO2 (D4) — boot-strap пины, могут давать ложные срабатывания
  // ISR во время инициализации модулей (LCD, I2C, WiFi) и до устаканивания питания.
  if (millis() < 2000UL) {
    // На всякий случай ещё раз чистим ISR-флаги
    noInterrupts();
    btnMain.irqFell = false;
    btnMenu.irqFell = false;
    interrupts();
    return;
  }

  ButtonAction actMain = read_button(BUTTON_PIN, btnMain);
  ButtonAction actMenu = read_button(MENU_BTN_PIN, btnMenu);

  // Подсветка: реагировать на физическое нажатие сразу, не ждать debounce/release
  bool anyPressed = (digitalRead(BUTTON_PIN) == LOW || digitalRead(MENU_BTN_PIN) == LOW);
  if (anyPressed || actMain != NO_ACTION || actMenu != NO_ACTION) {
    lastActivityTime = millis();
    lcd_backlight_activity(lcd);
  }

  if (actMain == SHORT_PRESS) {
    if (sys.menuScreen == 6) {
      adjust_calibration();
      pressCount = 0;
      sys.needsRedraw = true;
    } else if (sys.menuScreen == 7) {
      diagRunRequested = true;
      pressCount = 0;
      sys.needsRedraw = true;
    } else {
      pressCount++;
      lastPressTime = millis();
      if (pressCount >= TARE_COUNT) {
        // Подтверждено — выполняем тарирование
        perform_taring();
        pressCount = 0;
      } else {
        // Первое нажатие — показываем запрос подтверждения
        lcd.clear();
        lcd.setCursor(0, 0); lcd_print_padded(lcd, "Tara? Nazhmite ");
        char buf[17];
        snprintf(buf, sizeof(buf), "esche %d raz/3sek", TARE_COUNT - pressCount);
        lcd.setCursor(0, 1); lcd_print_padded(lcd, buf);
      }
    }
  }
  if (actMain == LONG_PRESS && sys.menuScreen != 6 && sys.menuScreen != 7) {
    perform_calibration();
    pressCount = 0;
    sys.needsRedraw = true;
  }
  if (pressCount > 0 && millis() - lastPressTime > TARE_TIMEOUT_MS) {
    // Таймаут — отменяем подтверждение
    pressCount = 0;
    lcd.clear();
    lcd.setCursor(0, 0); lcd_print_padded(lcd, "Tara: otmena    ");
    lcd.setCursor(0, 1); lcd_print_padded(lcd, "                ");
    { unsigned long _t=millis(); while(millis()-_t<800UL){app_wdt_reset();yield();} }
    sys.needsRedraw = true;
  }
  static int menuPressCount = 0;
  static unsigned long lastMenuPressTime = 0;

  if (actMenu == SHORT_PRESS) {
    menuPressCount++;
    if (menuPressCount == 1) {
      lastMenuPressTime = millis();
    } else if (millis() - lastMenuPressTime < 500UL) {
      if (sys.hasPrevOffset) {
        undo_tare();
      } else {
        // Нет предыдущей тары — двойное нажатие = просто ещё один шаг меню
        sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
        sys.needsRedraw = true;
      }
      menuPressCount = 0;
      return;
    } else {
      // Второе нажатие, но окно 500мс истекло (loop блокировался process_weight)
      // Прокручиваем меню за первое нажатие, текущее становится новым первым
      sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
      sys.needsRedraw = true;
      menuPressCount = 1;
      lastMenuPressTime = millis();
    }
  }
  if (menuPressCount == 1 && millis() - lastMenuPressTime >= 500UL) {
    sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
    sys.needsRedraw = true;
    menuPressCount = 0;
  }
  if (actMenu == LONG_PRESS) {
    sys.menuScreen = 0;
    menuPressCount = 0;
    sys.needsRedraw = true;
  }
}

void process_weight() {
  static unsigned long lastSaveTime         = 0;
  static unsigned long lastStableSaveTime   = 0;
  static unsigned long lastReadTime         = 0;
  static unsigned long lastPrevWeightSave   = 0;
  static float         lastSavedPrevWeight  = NAN;
  static float stableBuf[STABLE_BUF_SIZE];
  static int   stableBufIdx = 0;
  static int   stableBufCnt = 0;
  static bool  stableSaved  = false;

